app/views/shared/_header.html.erb

      <li><%= link_to "Sign out", destroy_user_session_path, :method => :delete %></li>
      <li><%= link_to "Profile Setting", current_user.user_profile.present? ? edit_user_profile_path(current_user.user_profile) : new_user_profile_path %></li>
---
SELECT  `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 3 LIMIT 1