app/views/home/index.html.erb

SELECT  `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1
---
              <div class="col-md-5">
                <% if current_user.user_profile.present?%>