app/controllers/home_controller.rb

  def index
    if current_user.user_profile.present?
---
SELECT  `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1