app/controllers/tweets_controller.rb

INSERT INTO `user_tweets` (`user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES (3, 6, '2016-05-08 18:38:39', '2016-05-08 18:38:39')
---
  def create
    @tweet = current_user.tweets.new(tweet_params)
    unless @tweet.save