app/controllers/user_profile_controller.rb

UPDATE `user_profiles` SET `age` = 11, `sex` = 'Female', `secondary_email` = 'email2jyotisingh@gmail.com', `attachment` = 'shiva.jpeg', `updated_at` = '2016-05-06 12:17:24' WHERE `user_profiles`.`id` = 11
INSERT INTO `user_profiles` (`user_id`, `age`, `sex`, `secondary_email`, `secondary_phone_number`, `created_at`, `updated_at`) VALUES (1, 34, 'female', 'email2jyotisingh@gmail.com', '3454656', '2016-05-06 08:47:47', '2016-05-06 08:47:47')
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 2  ORDER BY created_at DESC
---
  def create
    if @user_profile
      @user_profile.update_attributes(user_profile_params)
      redirect_to root_path
    else
      @user_profile = UserProfile.new(user_profile_params)
      @user_profile.save
      redirect_to root_path
    end
    @user_profile = UserProfile.where(:user_id => user_profile_params[:user_id]).order("created_at DESC")

UPDATE `user_profiles` SET `secondary_email` = 'DR@ghi.cok', `attachment` = 'ganesh1.jpeg', `updated_at` = '2016-05-08 16:04:36' WHERE `user_profiles`.`id` = 1
---
  def update
    @user_profile.update_attributes(user_profile_params)